[Killed] BlockStatement
main/components/Auth/SignInProviders.jsx:9:31
 import { FcGoogle } from "react-icons/fc";
 
 export default function SignInProviders({ onClick }) {
-  const microsoftIcon = () => {
-    return (
-      <span data-testid="SignInProvider-microsoftIcon">
-        <FaMicrosoft size="10em" role="img" />
-      </span>
-    );
-  };
+  const microsoftIcon = () => {};
 
   const { data: systemInfo } = useSystemInfo();
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInProvider-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Auth/SignInProviders.jsx:19:28
 
   const { data: systemInfo } = useSystemInfo();
 
-  const googleIcon = () => {
-    return (
-      <span data-testid="SignInProvider-googleIcon">
-        <FcGoogle size="10em" role="img" />
-      </span>
-    );
-  };
+  const googleIcon = () => {};
 
   return (
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInProvider-googleIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Auth/SignInProviders.jsx:34:8
       className="g-5 d-flex gap-5 justify-content-center align-items-center"
       data-testid="SignInProvider-cardDisplay"
     >
-      {systemInfo.oauthLogin && (
-        <SignInCard
-          Icon={googleIcon}
-          title="Sign in with Google"
-          description={
-            <>
-              If you have credentials with these schools, sign in with Google
-              <ul>
-                {loginProviderSchools.google.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.oauthLogin}
-          testid="google"
-          onClick={onClick}
-        />
-      )}
+      {systemInfo.oauthLogin || <SignInCard Icon={googleIcon} title="Sign in with Google" description={<>
+              If you have credentials with these schools, sign in with Google
+              <ul>
+                {loginProviderSchools.google.map((school, index) => <li key={index}>{school}</li>)}
+              </ul>
+            </>} url={systemInfo.oauthLogin} testid="google" onClick={onClick} />}
       {systemInfo.activeDirectoryUrl && (
         <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] ConditionalExpression
main/components/Auth/SignInProviders.jsx:34:8
       className="g-5 d-flex gap-5 justify-content-center align-items-center"
       data-testid="SignInProvider-cardDisplay"
     >
-      {systemInfo.oauthLogin && (
-        <SignInCard
-          Icon={googleIcon}
-          title="Sign in with Google"
-          description={
-            <>
-              If you have credentials with these schools, sign in with Google
-              <ul>
-                {loginProviderSchools.google.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.oauthLogin}
-          testid="google"
-          onClick={onClick}
-        />
-      )}
+      {false}
       {systemInfo.activeDirectoryUrl && (
         <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Auth/SignInProviders.jsx:42:50
             <>
               If you have credentials with these schools, sign in with Google
               <ul>
-                {loginProviderSchools.google.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
+                {loginProviderSchools.google.map(() => undefined)}
               </ul>
             </>
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Chico State University. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Auth/SignInProviders.jsx:53:8
           onClick={onClick}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title="Sign in with Microsoft"
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid="microsoft"
-          onClick={onClick}
-        />
-      )}
+      {systemInfo.activeDirectoryUrl || <SignInCard Icon={microsoftIcon} title="Sign in with Microsoft" description={<>
+              If you have credentials with these schools, sign in with Microsoft
+              <ul>
+                {loginProviderSchools.microsoft.map((school, index) => <li key={index}>{school}</li>)}
+              </ul>
+            </>} url={systemInfo.activeDirectoryUrl} testid="microsoft" onClick={onClick} />}
     </Row>
   );
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Found multiple elements with the role "img"

Here are the matching elements:

Ignored nodes: comments, script, style
<svg
  enable-background="new 0 0 48 48"
  fill="currentColor"

[Killed] ConditionalExpression
main/components/Auth/SignInProviders.jsx:53:8
           onClick={onClick}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title="Sign in with Microsoft"
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid="microsoft"
-          onClick={onClick}
-        />
-      )}
+      {true}
     </Row>
   );
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Auth/SignInProviders.jsx:61:53
             <>
               If you have credentials with these schools, sign in with Microsoft
               <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
+                {loginProviderSchools.microsoft.map(() => undefined)}
               </ul>
             </>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Oregon State University. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
