[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:31:42
   }
   // Stryker restore all
 
-  function cellToAxiosParamsDelete(data) {
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: data.id,
-        courseId: courseId,
-        removeFromOrg: data.removeFromOrg === "true",
-      },
-    };
-  }
+  function cellToAxiosParamsDelete(data) {}
 
   // Stryker disable all : hard to test for query caching
killedBy: CourseStaffTable tests Delete modal submits with removeFromOrg=false by default
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:32:12
   // Stryker restore all
 
   function cellToAxiosParamsDelete(data) {
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: data.id,
-        courseId: courseId,
-        removeFromOrg: data.removeFromOrg === "true",
-      },
-    };
+    return {};
   }
 
killedBy: CourseStaffTable tests Delete modal submits with removeFromOrg=false by default
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:35:15
     return {
       // Stryker disable next-line StringLiteral
       url: "/api/coursestaff/delete",
-      method: "DELETE",
+      method: "",
       params: {
         id: data.id,
killedBy: CourseStaffTable tests Delete modal submits with removeFromOrg=false by default
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:39:24
       params: {
         id: data.id,
         courseId: courseId,
-        removeFromOrg: data.removeFromOrg === "true",
+        removeFromOrg: true,
       },
     };
killedBy: CourseStaffTable tests Delete modal submits with removeFromOrg=false by default
statusReason: expected { id: 1, courseId: 7, …(1) } to deeply equal { id: 1, courseId: 7, …(1) }

[Killed] EqualityOperator
main/components/CourseStaff/CourseStaffTable.jsx:39:24
       params: {
         id: data.id,
         courseId: courseId,
-        removeFromOrg: data.removeFromOrg === "true",
+        removeFromOrg: data.removeFromOrg !== "true",
       },
     };
killedBy: CourseStaffTable tests Delete modal submits with removeFromOrg=false by default
statusReason: expected { id: 1, courseId: 7, …(1) } to deeply equal { id: 1, courseId: 7, …(1) }

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:70:11
   };
 
   const onEditSuccess = () => {
-    toast("Staff member updated successfully.");
+    toast("");
     hideModal();
   };
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Staff member updated successfully.",

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:74:42
     hideModal();
   };
 
-  const deleteCallback = async (cell) => {
-    setShowDeleteModal(true);
-    setDeleteStaff(cell.row.original.id);
-  };
+  const deleteCallback = async (cell) => {};
 
   const submitDeleteForm = (data) => {
killedBy: CourseStaffTable tests Delete button opens delete modal
statusReason: Unable to find an element by: [data-testid="CourseStaffDeleteModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:103:5
   };
 
   const columns = [
-    {
-      header: "id",
-      accessorKey: "id",
-      id: "id",
-    },
+    {},
     {
       header: "First Name",
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:109:15
       id: "id",
     },
     {
-      header: "First Name",
+      header: "",
       accessorKey: "firstName",
     },
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Unable to find an element with the text: First Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:166:11
     accessorKey: "orgStatus",
     cell: ({ cell }) => {
       const status = cell.row.original.orgStatus;
-      if (status === "PENDING") {
+      if (true) {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("PENDING")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Found multiple elements with the text: Pending

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="text-warning"
>

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:166:33
     accessorKey: "orgStatus",
     cell: ({ cell }) => {
       const status = cell.row.original.orgStatus;
-      if (status === "PENDING") {
-        return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("PENDING")}>
-            <span className="text-warning">Pending</span>
-          </OverlayTrigger>
-        );
-      } else if (status === "JOINCOURSE") {
+      if (status === "PENDING") {} else if (status === "JOINCOURSE") {
         return (
           <OverlayTrigger
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Pending. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:181:40
             <span className="text-primary">Join Course</span>
           </OverlayTrigger>
         );
-      } else if (status === "INVITED") {
-        return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("INVITED")}>
-            <span className="text-primary">Invited</span>
-          </OverlayTrigger>
-        );
-      } else if (status === "OWNER") {
+      } else if (status === "INVITED") {} else if (status === "OWNER") {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Invited. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:183:68
         );
       } else if (status === "INVITED") {
         return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("INVITED")}>
+          <OverlayTrigger placement="right" overlay={renderTooltip("")}>
             <span className="text-primary">Invited</span>
           </OverlayTrigger>
killedBy: CourseStaffTable tests tooltips for INVITED status
statusReason: Unable to find an element with the text: Staff member has generated an invite, but has not yet accepted or declined the invitation.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped tab

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:187:38
             <span className="text-primary">Invited</span>
           </OverlayTrigger>
         );
-      } else if (status === "OWNER") {
-        return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
-            <span className="text-info">Owner</span>
-          </OverlayTrigger>
-        );
-      } else if (status === "MEMBER") {
+      } else if (status === "OWNER") {} else if (status === "MEMBER") {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Owner. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:211:7
     },
   });
 
-  if (hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: CourseStaffTable tests Has the expected column headers, content for ordinary user
statusReason: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="CourseStaffTable-header-Delete-sort-header"
>

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:225:22
           <Modal.Title>Edit Staff Member</Modal.Title>
         </Modal.Header>
         <Modal.Body
-          className={"pb-3"}
+          className={""}
           data-testid={`${testIdPrefix}-modal-body`}
         >
killedBy: CourseStaffTable tests Edit button navigates to the edit modal
statusReason: expect(element).toHaveClass("pb-3")

Expected the element to have class:
  pb-3
Received:
  modal-body

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:245:25
       <div
         style={{ display: "none" }}
         data-testid={`${testIdPrefix}-courseId`}
-        data-course-id={`${courseId}`}
+        data-course-id={``}
       />
     </>
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: expect(element).toHaveAttribute("data-course-id", "7") // element.getAttribute("data-course-id") === "7"

Expected the element to have attribute:
  data-course-id="7"
Received:
  data-course-id=""
