[Killed] BlockStatement
main/components/CourseStaff/CourseStaffDeleteModal.jsx:10:27
   showModal,
   toggleShowModal,
 }) {
-  const hideModal = () => {
-    toggleShowModal(false);
-  };
+  const hideModal = () => {};
 
   const { register, handleSubmit } = useForm();
killedBy: CourseStaffDeleteModal tests Can click close
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffDeleteModal.jsx:11:21
   toggleShowModal,
 }) {
   const hideModal = () => {
-    toggleShowModal(false);
+    toggleShowModal(true);
   };
 
killedBy: CourseStaffDeleteModal tests Can click close
statusReason: expected "spy" to be called with arguments: [ false ]

Received: 

  1st spy call:

  [
-   false,

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffDeleteModal.jsx:20:17
     <Modal
       show={showModal}
       onHide={hideModal}
-      centered={true}
+      centered={false}
       data-testid="CourseStaffDeleteModal"
     >
killedBy: CourseStaffDeleteModal tests CourseStaffDeleteModal renders correctly, submits default
statusReason: expect(element).toHaveClass("modal-dialog-centered")

Expected the element to have class:
  modal-dialog-centered
Received:
  modal-dialog

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffDeleteModal.jsx:35:28
               label="Yes, I'd like to remove them from the GitHub Organization"
               value="true"
               id="remove-yes"
-              {...register("removeFromOrg")}
+              {...register("")}
             />
             <Form.Check
killedBy: CourseStaffTable tests Delete button opens delete modal
statusReason: Cannot read properties of undefined (reading '_f')
