[Killed] ArrayDeclaration
main/components/TabComponent/EnrollmentTabComponent.jsx:29:5
   const [csvErrorModalData, setCsvErrorModalData] = useState(null);
 
   const { data: rosterStudents } = useBackend(
-    [`/api/rosterstudents/course/${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/rosterstudents/course/${courseId}` },
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Cannot read properties of undefined (reading 'dataUpdateCount')

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:29:6
   const [csvErrorModalData, setCsvErrorModalData] = useState(null);
 
   const { data: rosterStudents } = useBackend(
-    [`/api/rosterstudents/course/${courseId}`],
+    [``],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/rosterstudents/course/${courseId}` },
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Cannot read properties of undefined (reading 'dataUpdateCount')

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:75:11
       onSuccess: () => onSuccessRoster(setPostModal),
       onError: (error) => {
         toast.error(
-          `Error adding student: ${JSON.stringify(error.response.data, null, 2)}`,
+          ``,
         );
       },
killedBy: EnrollmentTabComponent Tests RosterStudentForm works on error
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Error adding student: {

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:84:5
 
   const rosterCsvMutation = useBackendMutation(
     objectToAxiosParamsCSV,
-    {
-      onSuccess: () => onSuccessRoster(setCsvModal),
-      onError: (error) => {
-        if (error.response.status !== 409) {
-          toast.error(
-            `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
-          );
-        } else {
-          setCsvErrorModal(true);
-          setCsvErrorModalData(error.response.data.rejected);
-          setCsvModal(false);
-        }
-      },
-    },
+    {},
     [`/api/rosterstudents/course/${courseId}`],
   );
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected "spy" to be called with arguments: [ 'Roster successfully updated.' ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:114:23
   };
 
   return (
-    <div data-testid={`${testIdPrefix}-EnrollmentTabComponent`}>
+    <div data-testid={``}>
       <Modal
         show={csvErrorModal}
killedBy: InstructorCourseShowPage tests Tab Components are Present
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-EnrollmentTabComponent"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:125:43
         <ModalHeader closeButton>Upload CSV Roster</ModalHeader>
         <ModalBody>
           <p>
-            The following students couldn{"'"}t be uploaded to the roster as
+            The following students couldn{""}t be uploaded to the roster as
             their emails and student IDs match two separate students:
           </p>
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: 
Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:208:19
             .filter((student) => {
               const searchTermLower = searchTerm.toLowerCase();
               const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
+              if (true) {
                 return true;
               } else if (
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Emma
Received:
  Alice

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:208:78
             .filter((student) => {
               const searchTermLower = searchTerm.toLowerCase();
               const fullName = `${student.firstName} ${student.lastName}`;
-              if (student.studentId.toLowerCase().includes(searchTermLower)) {
-                return true;
-              } else if (
+              if (student.studentId.toLowerCase().includes(searchTermLower)) {} else if (
                 student.email.toLowerCase().includes(searchTermLower)
               ) {
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:211:17
               if (student.studentId.toLowerCase().includes(searchTermLower)) {
                 return true;
               } else if (
-                student.email.toLowerCase().includes(searchTermLower)
+                student.email.toUpperCase().includes(searchTermLower)
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:215:17
               ) {
                 return true;
               } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
+                false
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests Search filter works correctly GitHub Login, Student ID
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] OptionalChaining
main/components/TabComponent/EnrollmentTabComponent.jsx:215:17
               ) {
                 return true;
               } else if (
-                student.githubLogin?.toLowerCase().includes(searchTermLower)
+                student.githubLogin.toLowerCase().includes(searchTermLower)
               ) {
                 return true;
killedBy: EnrollmentTabComponent Tests CsvForm error returns correctly
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:218:26
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
               ) {
                 return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
+              } else if (false) {
                 return true;
               }
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] EqualityOperator
main/components/TabComponent/EnrollmentTabComponent.jsx:223:34
               }
               return false;
             })
-            .filter((student) => student.rosterStatus !== "DROPPED")}
+            .filter((student) => student.rosterStatus === "DROPPED")}
           currentUser={currentUser}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:233:26
         <h2>Dropped Students</h2>
         <DroppedStudentsTable
           students={rosterStudents.filter(
-            (student) => student.rosterStatus === "DROPPED",
+            (student) => true,
           )}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Found multiple elements with the text: Alice

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"
>
