[Killed] BlockStatement
main/components/Auth/SignInProviders.jsx:9:31
 import { FcGoogle } from "react-icons/fc";
 
 export default function SignInProviders({ onClick }) {
-  const microsoftIcon = () => {
-    return (
-      <span data-testid={"SignInPage-microsoftIcon"}>
-        <FaMicrosoft size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const microsoftIcon = () => {};
 
   const { data: systemInfo } = useSystemInfo();
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInPage-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Auth/SignInProviders.jsx:53:8
           onClick={onClick}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title={"Sign in with Microsoft"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid={"microsoft"}
-          onClick={onClick}
-        />
-      )}
+      {systemInfo.activeDirectoryUrl || <SignInCard Icon={microsoftIcon} title={"Sign in with Microsoft"} description={<>
+              If you have credentials with these schools, sign in with Microsoft
+              <ul>
+                {loginProviderSchools.microsoft.map((school, index) => <li key={index}>{school}</li>)}
+              </ul>
+            </>} url={systemInfo.activeDirectoryUrl} testid={"microsoft"} onClick={onClick} />}
     </Row>
   );
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Found multiple elements with the role "img"

Here are the matching elements:

Ignored nodes: comments, script, style
<svg
  enable-background="new 0 0 48 48"
  fill="currentColor"

[Killed] ConditionalExpression
main/components/Auth/SignInProviders.jsx:53:8
           onClick={onClick}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title={"Sign in with Microsoft"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid={"microsoft"}
-          onClick={onClick}
-        />
-      )}
+      {true}
     </Row>
   );
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
