[Killed] BlockStatement
main/components/Common/ConfirmationModal.jsx:10:28
   setShowModal,
   onYes,
 }) {
-  const closeModal = () => {
-    setShowModal(false);
-  };
+  const closeModal = () => {};
   return (
     <Modal
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="ConfirmationModal-base"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Common/ConfirmationModal.jsx:11:18
   onYes,
 }) {
   const closeModal = () => {
-    setShowModal(false);
+    setShowModal(true);
   };
   return (
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="ConfirmationModal-base"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Common/ConfirmationModal.jsx:17:17
     <Modal
       show={showModal}
       onHide={closeModal}
-      centered={true}
+      centered={false}
       data-testid={"ConfirmationModal-base"}
     >
killedBy: Sanity Check Modal works as designed
statusReason: expect(element).toHaveClass("modal-dialog-centered")

Expected the element to have class:
  modal-dialog-centered
Received:
  modal-dialog

[Killed] StringLiteral
main/components/Common/ConfirmationModal.jsx:18:20
       show={showModal}
       onHide={closeModal}
       centered={true}
-      data-testid={"ConfirmationModal-base"}
+      data-testid={""}
     >
       <Modal.Header>
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Unable to find an element by: [data-testid="ConfirmationModal-base"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Common/ConfirmationModal.jsx:24:24
         <Modal.Title>Are You Sure?</Modal.Title>
         <Button
           className="btn-close"
-          data-testid={"ConfirmationModal-closeButton"}
+          data-testid={""}
           onClick={closeModal}
         ></Button>
killedBy: Sanity Check Modal works as designed
statusReason: Unable to find an element by: [data-testid="ConfirmationModal-closeButton"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] BlockStatement
main/components/Common/ConfirmationModal.jsx:36:26
         <Button
           type="button"
           className="ms-auto"
-          onClick={() => {
-            onYes();
-            closeModal();
-          }}
+          onClick={() => {}}
           variant={"danger"}
         >
killedBy: Sanity Check Modal works as designed
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Common/ConfirmationModal.jsx:42:18
           }}
           variant={"danger"}
         >
-          Yes, I{"'"}d like to do this
+          Yes, I{""}d like to do this
         </Button>
       </Modal.Footer>
killedBy: Sanity Check Modal works as designed
statusReason: Unable to find an element with the text: Yes, I'd like to do this. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>
