[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:218:28
                 format:
               </p>
               <pre
-                className={"csvExample"}
+                className={""}
                 data-testid="rosterDownloadCsvExample"
               >
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:

[Survived] StringLiteral
main/pages/Help/HelpCsvPage.jsx:246:33
                   <tr>
                     <td>studentId</td>
                     <td>Student ID</td>
-                    <td>Student{"'"}s university ID (e.g., Perm # at UCSB)</td>
+                    <td>Student{""}s university ID (e.g., Perm # at UCSB)</td>
                   </tr>
                   <tr>

[Survived] StringLiteral
main/pages/Help/HelpCsvPage.jsx:271:33
                   <tr>
                     <td>githubId</td>
                     <td>GitHub user ID</td>
-                    <td>Student{"'"}s GitHub account ID, if connected</td>
+                    <td>Student{""}s GitHub account ID, if connected</td>
                   </tr>
                   <tr>
