[Killed] BlockStatement
src/main/pages/ProfilePage.jsx:14:35
 
 const ProfilePage = () => {
   const currentUser = useCurrentUser();
-  const onSuccess = (response) => {
-    toast(response.message);
-  };
+  const onSuccess = (response) => {};
 
   const disconnectGithub = useBackendMutation(
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/main/pages/ProfilePage.jsx:19:11
   };
 
   const disconnectGithub = useBackendMutation(
-    () => {
-      return {
-        url: "/api/github/disconnect",
-        method: "DELETE",
-      };
-    },
+    () => {},
     { onSuccess: onSuccess },
     ["current user"],
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/main/pages/ProfilePage.jsx:29:46
     ["current user"],
   );
 
-  const [viewModal, setViewModal] = useState(false);
+  const [viewModal, setViewModal] = useState(true);
 
   if (!currentUser.loggedIn) {
killedBy: ProfilePage tests renders correctly for admin user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="ConfirmationModal-base"
>
  <div
    class="modal-content"

[Killed] StringLiteral
src/main/pages/ProfilePage.jsx:45:51
         setShowModal={setViewModal}
       >
         <p>Are you sure you want to disconnect your Github account?</p>
-        <p>Please only do so if you know what you{"'"}re doing.</p>
+        <p>Please only do so if you know what you{""}re doing.</p>
       </ConfirmationModal>
       <Row className="align-items-center profile-header mb-5 text-center text-md-left">
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Unable to find an element with the text: Please only do so if you know what you're doing.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ConditionalExpression
src/main/pages/ProfilePage.jsx:66:10
       </Row>
       <Row className={"mt-3 g-3"} data-testid={"ProfilePage-advancedFeatures"}>
         <h2>Advanced Features</h2>
-        {hasRole(currentUser, "ROLE_GITHUB") && (
-          <>
-            <Col md={2}>
-              <Button variant={"danger"} onClick={() => setViewModal(true)}>
-                Disconnect GitHub
-              </Button>
-            </Col>
-          </>
-        )}
+        {false}
       </Row>
       <Row>
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Unable to find an element with the text: Disconnect GitHub. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ProfilePage.jsx:66:10
       </Row>
       <Row className={"mt-3 g-3"} data-testid={"ProfilePage-advancedFeatures"}>
         <h2>Advanced Features</h2>
-        {hasRole(currentUser, "ROLE_GITHUB") && (
-          <>
-            <Col md={2}>
-              <Button variant={"danger"} onClick={() => setViewModal(true)}>
-                Disconnect GitHub
-              </Button>
-            </Col>
-          </>
-        )}
+        {hasRole(currentUser, "ROLE_GITHUB") || <>
+            <Col md={2}>
+              <Button variant={"danger"} onClick={() => setViewModal(true)}>
+                Disconnect GitHub
+              </Button>
+            </Col>
+          </>}
       </Row>
       <Row>
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Unable to find an element with the text: Disconnect GitHub. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/ProfilePage.jsx:69:70
         {hasRole(currentUser, "ROLE_GITHUB") && (
           <>
             <Col md={2}>
-              <Button variant={"danger"} onClick={() => setViewModal(true)}>
+              <Button variant={"danger"} onClick={() => setViewModal(false)}>
                 Disconnect GitHub
               </Button>
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Unable to find an element by: [data-testid="ConfirmationModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/ProfilePage.jsx:69:51
         {hasRole(currentUser, "ROLE_GITHUB") && (
           <>
             <Col md={2}>
-              <Button variant={"danger"} onClick={() => setViewModal(true)}>
+              <Button variant={"danger"} onClick={() => undefined}>
                 Disconnect GitHub
               </Button>
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Unable to find an element by: [data-testid="ConfirmationModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
