[Killed] BlockStatement
src/main/pages/HomePageConnectGithub.jsx:9:28
 import { useLocation } from "react-router";
 
 export default function HomePageConnectGithub() {
-  const githubIcon = () => {
-    return (
-      <span data-testid={"HomePageConnectGithub-githubIcon"}>
-        <FaGithubSquare size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const githubIcon = () => {};
   const location = useLocation();
 
killedBy: HomePageConnectGithub tests renders without crashing
statusReason: Unable to find an element by: [data-testid="HomePageConnectGithub-githubIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/HomePageConnectGithub.jsx:18:29
   };
   const location = useLocation();
 
-  const setRedirect = () => {
-    sessionStorage.setItem("redirect", location.pathname);
-  };
+  const setRedirect = () => {};
 
   const { data: systemInfo } = useSystemInfo();
killedBy: HomePageConnectGithub tests Clicking button sets sessionStorage
statusReason: expected null to be '/example/return' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/HomePageConnectGithub.jsx:19:28
   const location = useLocation();
 
   const setRedirect = () => {
-    sessionStorage.setItem("redirect", location.pathname);
+    sessionStorage.setItem("", location.pathname);
   };
 
killedBy: HomePageConnectGithub tests Clicking button sets sessionStorage
statusReason: expected null to be '/example/return' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/HomePageConnectGithub.jsx:25:5
   const { data: systemInfo } = useSystemInfo();
 
   var githubOauthLogin =
-    systemInfo.githubOauthLogin || "/oauth2/authorization/github";
+    true;
 
   return (
killedBy: HomePageConnectGithub tests renders without crashing
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/github") // element.getAttribute("href") === "/oauth2/authorization/github"

Expected the element to have attribute:
  href="/oauth2/authorization/github"
Received:
  null

[Killed] LogicalOperator
src/main/pages/HomePageConnectGithub.jsx:25:5
   const { data: systemInfo } = useSystemInfo();
 
   var githubOauthLogin =
-    systemInfo.githubOauthLogin || "/oauth2/authorization/github";
+    systemInfo.githubOauthLogin && "/oauth2/authorization/github";
 
   return (
killedBy: HomePageConnectGithub tests renders without crashing
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/github") // element.getAttribute("href") === "/oauth2/authorization/github"

Expected the element to have attribute:
  href="/oauth2/authorization/github"
Received:
  null

[Killed] StringLiteral
src/main/pages/HomePageConnectGithub.jsx:45:21
               "Please connect your account with a GitHub account to continue to Frontiers."
             }
             url={githubOauthLogin}
-            testid={"github"}
+            testid={""}
             onClick={setRedirect}
           />
killedBy: HomePageConnectGithub tests renders without crashing
statusReason: Unable to find an element by: [data-testid="SignInCard-base-github"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
