[Killed] StringLiteral
main/components/Assignments/IndividualAssignmentForm.jsx:23:24
           type="text"
           isInvalid={Boolean(errors.repoPrefix)}
           data-testid="IndividualAssignmentForm-repoPrefix"
-          {...register("repoPrefix", {
+          {...register("", {
             required: "Repository Prefix is required.",
           })}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Assignments/IndividualAssignmentForm.jsx:48:24
           as="select"
           defaultValue={"MAINTAIN"}
           data-testid={"IndividualAssignmentForm-permissions"}
-          {...register("permissions")}
+          {...register("")}
         >
           <option value="READ">Read</option>
killedBy: No submit call on empty prefix
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Assignments/IndividualAssignmentForm.jsx:64:24
           as="select"
           defaultValue={"STUDENTS_ONLY"}
           data-testid={"IndividualAssignmentForm-creationTarget"}
-          {...register("creationTarget")}
+          {...register("")}
         >
           <option value="STUDENTS_ONLY">Students Only</option>
killedBy: No submit call on empty prefix
statusReason: Cannot read properties of undefined (reading '_f')
