[Killed] BlockStatement
main/components/TabComponent/AssignmentTabComponent.jsx:7:37
 import { toast } from "react-toastify";
 
 export default function AssignmentTabComponent({ courseId }) {
-  const onSuccessAssignment = () => {
-    toast("Repository creation successfully started.");
-  };
+  const onSuccessAssignment = () => {};
 
   const objectToAxiosParamsIndividualAssignment = (assignment) => ({
killedBy: Calls successfully
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/TabComponent/AssignmentTabComponent.jsx:11:51
     toast("Repository creation successfully started.");
   };
 
-  const objectToAxiosParamsIndividualAssignment = (assignment) => ({
-    url: `/api/repos/createRepos`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      repoPrefix: assignment.repoPrefix,
-      isPrivate: assignment.assignmentPrivacy,
-      permissions: assignment.permissions,
-      creationTarget: assignment.creationTarget,
-    },
-  });
+  const objectToAxiosParamsIndividualAssignment = () => undefined;
 
   const indvidiualAssignmentMutation = useBackendMutation(
killedBy: Calls successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Repository creation successfully started.",

[Killed] StringLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:13:13
 
   const objectToAxiosParamsIndividualAssignment = (assignment) => ({
     url: `/api/repos/createRepos`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: Calls successfully
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Repository creation successfully started.",

[Killed] BlockStatement
main/components/TabComponent/AssignmentTabComponent.jsx:28:52
     { onSuccess: onSuccessAssignment },
   );
 
-  const postIndividualAssignment = (assignment) => {
-    indvidiualAssignmentMutation.mutate(assignment);
-  };
+  const postIndividualAssignment = (assignment) => {};
   return (
     <Row md={2} data-testid={"AssignmentTabComponent"}>
killedBy: Calls successfully
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
